In [5]:
import pandas as pd
list = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list)

In [6]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
dic = {"ID" : [1, 2, 3 ,4], "Name" : ["Ali", "Ahmad", "Sameer", "Zain"]}
df = pd.DataFrame(dic)

In [8]:
df

   ID    Name
0   1     Ali
1   2   Ahmad
2   3  Sameer
3   4    Zain

In [9]:
dic = {"ID" : [1, 2, 3 ,4], "Name" : ["Ali", "Ahmad", "Sameer", "Zain"]}, {"ID" : [1, 2, 3 ,4], "Name" : ["Ali", "Ahmad", "Sameer", "Zain"]}
df = pd.DataFrame(dic)

In [10]:
df

             ID                        Name
0  [1, 2, 3, 4]  [Ali, Ahmad, Sameer, Zain]
1  [1, 2, 3, 4]  [Ali, Ahmad, Sameer, Zain]

In [11]:
dic1 = {"ID" : pd.Series([1, 2, 3 ,4]), "Name" : pd.Series(["Ali", "Ahmad", "Sameer", "Zain"])}
df = pd.DataFrame(dic1)
df

   ID    Name
0   1     Ali
1   2   Ahmad
2   3  Sameer
3   4    Zain

In [37]:
import pandas as pd
df = pd.read_csv("C:\\Users\\ibrah\\Python\\titanic.csv")

In [38]:
df

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [39]:
df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [40]:
df.tail()

     PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [41]:
df.sample(10)

     PassengerId  Survived
111         1003         0
363         1255         0
381         1273         0
222         1114         1
269         1161         0
7            899         0
115         1007         0
324         1216         1
136         1028         0
254         1146         0

In [42]:
df.sample()

     PassengerId  Survived
156         1048         1

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [44]:
df.columns

Index(['PassengerId', 'Survived'], dtype='object')

In [45]:
print("Shape of dataset:", df.shape)   # Rows & columns
print("\nColumn names:", df.columns.tolist())  # List of columns
print("\nData types:\n", df.dtypes)   # Data types
print("\nGeneral info:")
print(df.info())   # Memory usage + null counts + dtypes
print("\nFirst 5 rows:\n", df.head())   # Peek into data
print("\nLast 5 rows:\n", df.tail())

Shape of dataset: (418, 2)

Column names: ['PassengerId', 'Survived']

Data types:
 PassengerId    int64
Survived       int64
dtype: object

General info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB
None

First 5 rows:
    PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

Last 5 rows:
      PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [46]:
df.loc[2]

PassengerId    894
Survived         0
Name: 2, dtype: int64

In [47]:
df.iloc[0:3]

   PassengerId  Survived
0          892         0
1          893         0
2          894         0

In [48]:
df = df.rename(columns={
    "PassengerID": "Passenger_ID",
    "Survived": "IsSurvived"
})
print(df.head())

   PassengerId  IsSurvived
0          892           0
1          893           0
2          894           0
3          895           0
4          896           1

In [49]:
print("\nMissing values per column:\n", df.isnull().sum())
print("\nPercentage of missing values:\n", (df.isnull().mean() * 100).round(2))

Missing values per column:
 PassengerId    0
IsSurvived     0
dtype: int64

Percentage of missing values:
 PassengerId    0.0
IsSurvived     0.0
dtype: float64

In [50]:
print("\nNumber of duplicate rows:", df.duplicated().sum())

Number of duplicate rows: 0

In [51]:
print("\nNumerical summary:\n", df.describe())

Numerical summary:
        PassengerId  IsSurvived
count   418.000000  418.000000
mean   1100.500000    0.366029
std     120.810458    0.482295
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

In [52]:
print("\nUnique values per column:\n", df.nunique())

Unique values per column:
 PassengerId    418
IsSurvived       2
dtype: int64

In [53]:
data = {
    "Department": ["HR", "HR", "IT", "IT", "Finance", "Finance", "IT"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "George"],
    "Salary": [50000, 52000, 60000, 62000, 58000, 60000, 64000],
    "Bonus": [5000, 6000, 7000, 6500, 5500, 6000, 7200]
}

df = pd.DataFrame(data)
print(df)

  Department Employee  Salary  Bonus
0         HR    Alice   50000   5000
1         HR      Bob   52000   6000
2         IT  Charlie   60000   7000
3         IT    David   62000   6500
4    Finance      Eva   58000   5500
5    Finance    Frank   60000   6000
6         IT   George   64000   7200

In [54]:
# Average salary per department
df.groupby("Department")["Salary"].sum()

Department
Finance    118000
HR         102000
IT         186000
Name: Salary, dtype: int64

In [55]:
df.groupby("Department")["Salary"].agg(["mean", "min", "max", "count"])

               mean    min    max  count
Department
Finance     59000.0  58000  60000      2
HR          51000.0  50000  52000      2
IT          62000.0  60000  64000      3

In [58]:
# Keep only departments where average salary > 55k
filtered = df.groupby("Department").filter(lambda x: x["Salary"].mean() > 55000)
filtered

  Department Employee  Salary  Bonus
2         IT  Charlie   60000   7000
3         IT    David   62000   6500
4    Finance      Eva   58000   5500
5    Finance    Frank   60000   6000
6         IT   George   64000   7200